In [3]:
import pandas as pd
print('version:',pd.__version__)

version: 2.2.3

In [7]:
list=[1,9,4,29,54,89,28]
myseries=pd.Series(list)
print(myseries)
print('Element at Index 3',myseries[3])

0     1
1     9
2     4
3    29
4    54
5    89
6    28
dtype: int64
Element at Index 3 29

In [8]:
import pandas as pd
b=[1,7,4]
myVar=pd.Series(b,index=['a','b','c'])
print(myVar)
print(myVar["b"])

a    1
b    7
c    4
dtype: int64
7

In [9]:
employee={
    "id":1,
    "name":"Hema",
    "email":"hema@gmail.com",
    "address":"Mysuru",
    "salary":22000
}
data=pd.Series(employee)
print(data)
print("id",data["id"])
print("name",data["name"])

id                      1
name                 Hema
email      hema@gmail.com
address            Mysuru
salary              22000
dtype: object
id 1
name Hema

In [10]:
sample={
    "id":[1,2,3,4],
    "name":["alice","bob"],
    "age":[20,25,26],
    "city":["new york","chicago"]
}
df=pd.DataFrame(data)
print(df)

                      0
id                    1
name               Hema
email    hema@gmail.com
address          Mysuru
salary            22000

In [14]:
import pandas as pd
data={
    "name":["alice","bob","catty"],
    "age":[22,23,24]
}
myvar=pd.DataFrame(data)
print(myVar)
print("first row")
print(myvar.loc[0])
print(myvar.loc[[0,1]])

a    1
b    7
c    4
dtype: int64
first row
name    alice
age        22
Name: 0, dtype: object
    name  age
0  alice   22
1    bob   23

In [17]:
user_data={
    "name":["alex","bob","cat"],
    "age":[22,34,22]
}
df1=pd.DataFrame(user_data,index=["u1","u2","u3"])
print(df1.loc["u3"])
print(df1)

name    cat
age      22
Name: u3, dtype: object
    name  age
u1  alex   22
u2   bob   34
u3   cat   22

In [19]:
user_data={
    "name":["alex","bob","cat"],
    "age":[22,34,22]
}
df1=pd.DataFrame(user_data)

print(df1)

   name  age
0  alex   22
1   bob   34
2   cat   22

In [20]:
import pandas as pd
data=[
    ["alice",25,"benagluru"],
    ["Elsae",35,"bombay"],
    ["bob",23,"mysuru"]
]
df=pd.DataFrame(data,columns=["name","age","city"])
print(df)

    name  age       city
0  alice   25  benagluru
1  Elsae   35     bombay
2    bob   23     mysuru

In [26]:
student_data=pd.read_csv('student_datas.csv')
print(student_data)

   id                 first_name        last_name  \
0   1             Lukas Macknish         Macknish
1   2  Sanderson Sainsbury-Brown  Sainsbury-Brown
2   3        Frieda Bestwerthick     Bestwerthick
3   4               Vivi Dockray          Dockray
4   5            Myrtie Castenda         Castenda
5   6              Grace Padgham          Padgham
6   7              Alix Breffitt         Breffitt
7   8         Waring Phettiplace      Phettiplace
8   9                 Seth Bazek            Bazek
9  10          Cindelyn Freebury         Freebury

                            email       gender  grade
0            lmacknish0@sogou.com         Male    3.2
1  ssainsburybrown1@cafepress.com         Male    8.4
2      fbestwerthick2@oaic.gov.au       Female    1.0
3       vdockray3@marketwatch.com       Female    7.6
4            mcastenda4@mysql.com       Female    5.2
5              gpadgham5@furl.net         Male    2.3
6        abreffitt6@homestead.com      Agender    9.1
7    wphettiplace7@slideshare.net  Genderqueer    7.3
8               sbazek8@blogs.com         Male    3.4
9             cfreebury9@gmpg.org       Female    1.5

In [30]:
#directly taking tabular structure
student_data.head()
#print(student_datas.head())

,id,first_name,last_name,email,gender,grade
0,1,Lukas Macknish,Macknish,lmacknish0@sogou.com,Male,3.2
1,2,Sanderson Sainsbury-Brown,Sainsbury-Brown,ssainsburybrown1@cafepress.com,Male,8.4
2,3,Frieda Bestwerthick,Bestwerthick,fbestwerthick2@oaic.gov.au,Female,1.0
3,4,Vivi Dockray,Dockray,vdockray3@marketwatch.com,Female,7.6
4,5,Myrtie Castenda,Castenda,mcastenda4@mysql.com,Female,5.2

In [33]:
print(student_data.to_string())

   id                 first_name        last_name                           email       gender  grade
0   1             Lukas Macknish         Macknish            lmacknish0@sogou.com         Male    3.2
1   2  Sanderson Sainsbury-Brown  Sainsbury-Brown  ssainsburybrown1@cafepress.com         Male    8.4
2   3        Frieda Bestwerthick     Bestwerthick      fbestwerthick2@oaic.gov.au       Female    1.0
3   4               Vivi Dockray          Dockray       vdockray3@marketwatch.com       Female    7.6
4   5            Myrtie Castenda         Castenda            mcastenda4@mysql.com       Female    5.2
5   6              Grace Padgham          Padgham              gpadgham5@furl.net         Male    2.3
6   7              Alix Breffitt         Breffitt        abreffitt6@homestead.com      Agender    9.1
7   8         Waring Phettiplace      Phettiplace    wphettiplace7@slideshare.net  Genderqueer    7.3
8   9                 Seth Bazek            Bazek               sbazek8@blogs.com         Male    3.4
9  10          Cindelyn Freebury         Freebury             cfreebury9@gmpg.org       Female    1.5

In [34]:
print(student_data.head(3))

   id                 first_name        last_name  \
0   1             Lukas Macknish         Macknish
1   2  Sanderson Sainsbury-Brown  Sainsbury-Brown
2   3        Frieda Bestwerthick     Bestwerthick

                            email  gender  grade
0            lmacknish0@sogou.com    Male    3.2
1  ssainsburybrown1@cafepress.com    Male    8.4
2      fbestwerthick2@oaic.gov.au  Female    1.0

In [35]:
print(student_data.tail(3))

   id          first_name    last_name                         email  \
7   8  Waring Phettiplace  Phettiplace  wphettiplace7@slideshare.net
8   9          Seth Bazek        Bazek             sbazek8@blogs.com
9  10   Cindelyn Freebury     Freebury           cfreebury9@gmpg.org

        gender  grade
7  Genderqueer    7.3
8         Male    3.4
9       Female    1.5

In [36]:
#number of rows and columns
print(student_data.shape)

(10, 6)

In [37]:
#summary
print(student_data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          10 non-null     int64
 1   first_name  10 non-null     object
 2   last_name   10 non-null     object
 3   email       10 non-null     object
 4   gender      10 non-null     object
 5   grade       10 non-null     float64
dtypes: float64(1), int64(1), object(4)
memory usage: 612.0+ bytes
None

In [38]:
student_data.describe()

             id      grade
count  10.00000  10.000000
mean    5.50000   4.900000
std     3.02765   3.012935
min     1.00000   1.000000
25%     3.25000   2.525000
50%     5.50000   4.300000
75%     7.75000   7.525000
max    10.00000   9.100000

In [39]:
print(student_data.describe())

             id      grade
count  10.00000  10.000000
mean    5.50000   4.900000
std     3.02765   3.012935
min     1.00000   1.000000
25%     3.25000   2.525000
50%     5.50000   4.300000
75%     7.75000   7.525000
max    10.00000   9.100000

In [43]:
student_data['grade'].describe()

count    10.000000
mean      4.900000
std       3.012935
min       1.000000
25%       2.525000
50%       4.300000
75%       7.525000
max       9.100000
Name: grade, dtype: float64

In [ ]:
import pandas as pd
df=pd.read_csv('store_data.csv')